%  P015 1-3
%(1)
%四进制的码元携带的信息量为
Tb1=5;
TB1=Tb1*log2(4);
RB1=1/TB1;
Rb1=RB1*log2(4);
%由于单位是毫秒，所以转化为秒
Rb1=Rb1*1000
%Rb1的值为200

%(2)
PA=1/5;
PB=1/4;
PC=1/4;
PD=3/10;
%平均信息量H1是
H1=PA*[-log2(PA)]+PB*[-log2(PB)]+PC*[-log2(PC)]+PD*[-log2(PD)]
Tb2=5;
Rb2=1/Tb2;
Rb2=Rb2*1000
%Rb2的值为200

%P016 1-5
%平均信息量为H3
P1=1/32;
P2=1/224;
H3=16*P1*[-log2(P1)]+112*P2*[-log2(P2)]
TB3=1/1000;
RB3=1/TB3;
Rb3=RB3*H3
%Rb3的值为6.4037e+03

%P016 1-7
%(1)
%平均信息量H4
PA2=1/4;
PB2=1/8;
PC2=1/8;
PD2=3/16;
PE2=5/16;
H4=PA2*[-log2(PA2)]+PB2*[-log2(PB2)]+PC2*[-log2(PC2)]+PD2*[-log2(PD2)]+PE2*[-log2(PE2)]
%H4的答案为2.2272

%(2)
%平均信息传输速率Rb
RB4=1000;
Rb4=RB4*H4
%一小时内传送的平均信息量W
W=Rb4*3600
%W的值为8.0180e+06

%（3）
%由于信号源是等概率发送的所以平均信息量I4为
I4=log2(5);
%而
RB4=1000;
%平均信息传输速率为
Rb5=RB4*I4
%Rb5=2.3219e+03
%所以一个小时传递的平均信息量为W2
W2=Rb5*3600
%W5的值为8.3589e+06

%P016 1-8
Rb=2400;
%0.5小时传递的总信息量是W3
W3=Rb*1800;
%传递的总码元数为W4
W4=W3/log2(4)
Pe=216/W4
%误码率为1.0000e-04




